БухЭксп/Reports/CW_СтатистикаНахожденияДокументаВСтатусах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_СтатистикаНахожденияДокументаВСтатусах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДокументовДляОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиВыводаСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиВыводаСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредопределеннаяКолонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФорматЗначения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Reports/CW_СтатистикаНахожденияДокументаВСтатусах/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Получаем схему из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	НастройкиОтчета 	= Справочники.CW_НастройкиВыводаСтатистики.ПолучитьНастройкуПоОбъекту(ИдентификаторОбъекта);
	
	МетаданныеОбъекта 	= ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъекта);
	ЭтоДокумент 		= Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ИдентификаторОбъекта.ЗначениеПустойСсылки));

	ДополнительныеПоля = "";
	Если НЕ НастройкиОтчета.Пустая() Тогда
		Для Каждого СтрокаНастроек из НастройкиОтчета.НастройкиКолонок Цикл
			
			Если СтрокаНастроек.ПредопределеннаяКолонка Тогда
				Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти(СтрокаНастроек.Имя);
				Поле.Заголовок = СтрокаНастроек.Заголовок;
				Продолжить;
			КонецЕсли;
			
			ВыражениеПредставления = "";
			//Список дополнительных полей запроса.
			ДополнительныеПоля = ДополнительныеПоля + "
			|ВТ_ДанныеОтчета.Ссылка."+СтрокаНастроек.Имя + " КАК "+ СтрокаНастроек.Имя+",";
			
			//Добавляем поля в скд
			Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			Поле.Заголовок      		= СтрокаНастроек.Заголовок;
			Поле.ПутьКДанным    		= СтрокаНастроек.Имя;
			Поле.Поле           		= СтрокаНастроек.Имя;
			Поле.ВыражениеПредставления = ВыражениеПредставления;
			
		КонецЦикла;
	КонецЕсли;
	
	//
	//Меняем текст запрсоа
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ПоляДокумента", ДополнительныеПоля);
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Строки = Настройки.Структура[1].Строки;
	Строка = Строки[0];//.Добавить();
	
	//Добавляем поля
	Если НЕ НастройкиОтчета.Пустая() Тогда
		Для Каждого СтрокаНастроек из НастройкиОтчета.НастройкиКолонок Цикл
			// Добавим выбранное поле для вывода в отчет.  
			ВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаНастроек.Имя);
			
			// Укажем, по какому полю нужно группировать
			ПолеГруппировки = Строка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(СтрокаНастроек.Имя);
			
			Если СтрокаНастроек.Ширина <> 0 или ЗначениеЗаполнено(СтрокаНастроек.Формат) Тогда
				// Добавим условное оформление.
				ЭлементУсловногоОформления = Настройки.УсловноеОформление.Элементы.Добавить();
				
				// Создадим условие оформления.
				ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрокаНастроек.Имя);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
				
				// Укажем, что оформление нужно применять только к одному полю.
				ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаНастроек.Имя);
				
				Если СтрокаНастроек.Ширина <> 0 Тогда
					// Укажем МинимальнаяШирина.
					ЭлементОформления = ЭлементУсловногоОформления.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МинимальнаяШирина"));
					ЭлементОформления.Использование = Истина;
					ЭлементОформления.Значение 		= СтрокаНастроек.Ширина;
					// Укажем МаксимальнаяШирина.
					ЭлементОформления = ЭлементУсловногоОформления.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МаксимальнаяШирина"));
					ЭлементОформления.Использование = Истина;
					ЭлементОформления.Значение 		= СтрокаНастроек.Ширина;
				КонецЕсли;
				Если Не ПустаяСтрока(СтрокаНастроек.Формат) Тогда
					// Укажем формат.
					ЭлементОформления = ЭлементУсловногоОформления.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"));
					ЭлементОформления.Использование = Истина;
					ЭлементОформления.Значение 		= СтрокаНастроек.Формат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;          
	Иначе
		// Добавим выбранное поле для вывода в отчет.  
		ВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		
		// Укажем, по какому полю нужно группировать
		ПолеГруппировки = Строка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Ссылка");

	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресДокументовДляОтбора) Тогда
		мДокументы = ПолучитьИзВременногоХранилища(АдресДокументовДляОтбора);
		
		Если ТипЗнч(мДокументы) = Тип("Массив")  Тогда
			СписокДокументов = Новый СписокЗначений;
			СписокДокументов.ЗагрузитьЗначения(мДокументы);
			
			// Добавим отбор по документам
			ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = СписокДокументов;
		КонецЕсли;
		
	КонецЕсли;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	ДокументРезультат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	
КонецПроцедуры
